# -*-rd-*-
= ╩╤╣╣┼└

== 0.4.1 длдщд╬дкдтд╩╩╤╣╣┼└ (0.4.2)

=== ┐╖д╖дд╡б╟╜

: CocoaBindingsд╬е╡е▌б╝е╚

  Mac OS X 10.3 ░╩╣▀д╟д╧бвrubyе╣епеъе╫е╚╛хд╟─ъ╡┴д╖д┐Cocoaепеще╣д╬е╡е╓епеще╣д╟дт
  Objective-Cд╟─ъ╡┴д╖д┐епеще╣д╚╞▒д╕дшджд╦бвCocoaBindingsдЄ═°═╤д╣дыд│д╚дмд╟днд▐д╣бг

  ╛▄д╖дпд╧бве╡еєе╫еыд╬CurrencyConverterдфRubySpotlightдЄ╕лд╞дпд└д╡ддбг

: CoreDataд╬е╡е▌б╝е╚

  Mac OS X 10.4 д╟д╧бвosx/coredata.rbд╦дшдъбвCoreDataд╦┤╪д╣дыепеще╣д╚─ъ┐Їдм
  ═°═╤д╟днд▐д╣бг 

: ╣╜├█╗■д╬е╞е╣е╚дм┤╩├▒д╦

  `ruby install.rb setup'д╟е╙еые╔д╖д┐╕хд╦бв░╩▓╝д╬е│е▐еєе╔д╟е╞е╣е╚е╣епеъе╫е╚дЄ
  ╝┬╣╘д╣дыд│д╚дмд╟днд▐д╣бг

    % ruby install.rb test

=== е╨е░╜д└╡

: rubyд╬еке╓е╕езепе╚дмепеще╣OSX::OCObjectд╦д╩д├д╞д╖д▐дж

  Cocoaд╬еке╓е╕езепе╚д╦pure rubyд╬еке╓е╕езепе╚дЄ┼╧д╣д╚бвд╜д╬еке╓е╕езепе╚дЄ
  ╝шдъ╜╨д╖д┐д╚днд╦OSX::OCObjetепеще╣д╬еке╓е╕езепе╚д╦д╩д├д╞д╖д▐ддд▐ддд▐д╖д┐бг

  д┐д╚дид╨╝бд╬дшджд╩╛ї╢╖дм╚п└╕д╖д╞ддд▐д╖д┐бг

    obj = RubyClass.new
    nsary = OSX::NSArray.arrayWithObjects(obj, nil)
    nsary.objectAtIndex(0) # => RubyClassд╟д╩дпбвOSX::OCObjetепеще╣д╦


: itunes_albums.rbдмNSCharacterConversionExceptionдм╡пднды

  е╡еєе╫еыд╬itunes_albums.rbдмбв░╩▓╝д╬еиещб╝д╦дшдъепеще├е╖ехд╖д╞д╖д▐джд│д╚дм
  двдъд▐д╖д┐бг

    Uncaught exception: 
    <NSCharacterConversionException> Conversion to encoding ...

  ┐╖д╖дде╨б╝е╕ечеєд╬RubyCocoaд╟д╧бв$KCODEд╬├═д╦дшдъrubyд╬╩╕╗·╬єд╚NSStringд╬
  ╩╤┤╣дЄ╣╘дждшджд╦д╖д▐д╖д┐бг
  

: Cocoaепеще╣д╬е╡е╓епеще╣д╬е╡е╓епеще╣дЄ─ъ╡┴д╣дыд╚епеще├е╖ехд╣ды

  ░╩▓╝д╬╬уд╬дшджд╦епеще├е╖ехд╖д╞д╖д▐дж╠ф┬ъдЄ╜д└╡д╖д▐д╖д┐бг

    class A < OSX::NSObject
    end

    class B < A
    end

    b = B.alloc.init # => crash

== 0.4.0 длдщд╬дкдтд╩╩╤╣╣┼└ (0.4.1)

: rubyе╣епеъе╫е╚╝┬╣╘╗■д╦LoadErrorдм╚п└╕д╣ды

  rubyдм--enable-sharedеке╫е╖ечеєд╩д╖д╟е╙еые╔д╡дьд╞дддыд╚днбв
  д╜д╬rubyд╟RubyCocoaдЄ╣╜├█д╣дыд╚╝бд╬еиещб╝д╚д╩ды╠ф┬ъдЄ╜д└╡д╖д▐д╖д┐бг

    osx/cocoa.rb:12:in `require': No such file to load -- osx/objc/cocoa (LoadError)

: Mac OS X 10.3(Panther)дкдшд╙Xcodeе╡е▌б╝е╚

  Mac OS X 10.3╛хд╟╣╜├█▓─╟╜д╦д╩дъд▐д╖д┐бг
  д▐д┐бвXcodeд╬е╫еэе╕езепе╚е╞еєе╫еьб╝е╚дЄедеєе╣е╚б╝еыд╣дыдшджд╦д╩дъд▐д╖д┐бг

== 0.4.0 длдщд╬дкдтд╩╩╤╣╣┼└ (0.4.1d9)

: ruby 1.8.0 ┬╨▒■

  ruby 1.8.0 д╟╜╨дыдшджд╦д╩д├д┐дддпд─длд╬╖┘╣Ёдфеиещб╝дЄ╜д└╡д╖д▐д╖д┐бг

== 0.4.0 длдщд╬дкдтд╩╩╤╣╣┼└ (0.4.1d8)

: RubyCocoa.frameworkдЄ┴╚д▀╣■д▀▓─╟╜д╦д╖д┐

  RubyCocoaдмедеєе╣е╚б╝еыд╡дьд╞ддд╩дд┤─╢нд╟бвRubyCocoaеве╫еъе▒б╝е╖ечеє
  дЄ╞░║ю▓─╟╜д╦д╣дыд┐дсбвRubyCocoa.frameworkд╬е╙еые╚└▀─ъдЄ╩╤╣╣д╖д▐д╖д┐бг
  RubyCocoaеве╫еъе▒б╝е╖ечеє╝л┬╬д╦RubyCocoa.frameworkдЄ┴╚д▀╣■дєд╟╗╚джд│
  д╚дмд╟днд▐д╣бг

: WebKit.framework┬╨▒■

  kimura wataru д╡дєд╦дшд├д╞╜ёдлдьд┐ WebKit.framework ═╤д╬ещеде╓ещеъдЄ
  ─╔▓├д╖д▐д╖д┐бг((- WebKit┬╨▒■д╦д─ддд╞бвkimura wataruд╡дєд╚ s.sawada д╡
  дєд╬╝шдъ┴╚д▀д╦┤╢╝╒д╖д▐д╣бг-))

: initесе╜е├е╔дЄns_overrideд╣дыд╚╬у│░дмдвдмдые╨е░дЄ╜д└╡

  ns_overrideд╖д┐initесе╜е├е╔д╬─ъ╡┴д╬├цд╟бвsuper_initдЄ╕╞д╓д╚╬у│░дм╚п└╕
  д╣дые╨е░дЄбв╜д└╡д╖д▐д╖д┐бг

: д╜д╬┬╛

  RCDataAttachmentете╕ехб╝еыдЄ─ъ╡┴бгNSData, NSStrng епеще╣д╦дддпд─длд╬
  епеще╣есе╜е├е╔дЄ─ъ╡┴бг

== 0.3.2 длдщд╬дкдтд╩╩╤╣╣┼└ (0.4.0)

: Ruby 1.8д╦┬╨▒■

  Ruby 1.8д╚д╬┴╚╣чд╗д╟╗╚дидыдшджд╦д╩дъд▐д╖д┐бг
  '-w'╔╒днд╟╝┬╣╘д╖д┐д╚днд╦╚п└╕д╖д╞ддд┐бвесе╜е├е╔д╬░·┐Їд╦┤╪д╣ды╖┘╣Ёдм
  д╩дпд╩дыдшджд╦╜д└╡д╖д▐д╖д┐бг

: RubyCocoa.frameworkдм╔№│ш

  Rubyд╟╜ёдлдьд╞ддды╔Ї╩мдт┤▐дсд╞бв┤Ё╦▄╝┬┴їд╬д╣д┘д╞дЄRubyCocoaе╒еьб╝ереяб╝еп
  д╬├цд╦д▐д╚дсд▐д╖д┐бге╨еде╩еъ╟█╔╒д╟д╧libruby╝л┐╚дтRubyCocoaе╒еьб╝ереяб╝еп
  д╦└┼┼кеъеєепд╖д╞ддд▐д╣бг
  д│дьд╦дшдъRubyCocoaеве╫еъе▒б╝е╖ечеєдм╟█╔╒д╖дфд╣дпд╩д├д┐д╧д║д╟д╣бг

: │╚─еещеде╓ещеъ╠╛дЄ╩╤╣╣

  │╚─еещеде╓ещеъд╬╠╛┴░дЄosx_objc.bundleдлдщrubycocoa.bundleд╦╩╤╣╣д╖д▐д╖д┐бг
  д│д╬│╚─еещеде╓ещеъд╧бвrubyе│е▐еєе╔дфirbе│е▐еєе╔длдщRubyCocoaе╒еьб╝ереяб╝еп
  дЄ═°═╤д╣дыд┐дсд╬stubещеде╓ещеъд╦д╩дъд▐д╖д┐бг

: ещеде╓ещеъдЄ░▄╞░

  osx/objcе╟егеьепе╚еъд╦┤▐д▐дьд╞ддд┐ещеде╓ещеъд╧бве╟егеьепе╚еъд┤д╚┴┤д╞
  е╒еьб╝ереяб╝еп┬жд╦░▄╞░д╖д▐д╖д┐бг
  д▐д┐бвosxе╟егеьепе╚еъ░╩▓╝д╬RubyCocoaещеде╓ещеъд╧бвrubyе│е▐еєе╔дф
  irbе│е▐еєе╔длдщRubyCocoaдЄ╗╚джд┐дсд╬stubещеде╓ещеъд╦д╩дъд▐д╖д┐бг


== 0.3.1 длдщд╬дкдтд╩╩╤╣╣┼└ (0.3.2)

=== AddressBook.framework ═╤д╬ещеде╓ещеъдЄ─╔▓├

╗╚═╤╬у:

  require 'osx/addressbook'
  ab = OSX::ABAddressBook.sharedAddressBook
  ab.people.to_a.each {|i| puts i.compositeName.to_s.toeuc }


== 0.3.0 длдщд╬дкдтд╩╩╤╣╣┼└ (0.3.1)

=== Objective-Cеке╓е╕езепе╚д╦┬╨д╣дыеъе╒еьепе╖ечеє╡б╟╜д╬▓■╬╔

OCObjWrapper#objc_methods, OCObjWrapper#objc_method_type дЄ─ъ╡┴бг

=== ╬у│░есе├е╗б╝е╕д╬▓■╬╔

Objective-C еке╓е╕езепе╚д╦┬╨д╣дыесе╜е├е╔╕╞╜╨д╖д╦┤╪╧вд╖д╞╚п└╕д╡д╗д┐╬у│░
д╬есе├е╗б╝е╕╞т═╞д╦есе╜е├е╔╠╛бж┤╪┐Ї╠╛д╩д╔дЄ┤▐дсдыдшджд╦д╖д┐бг

NS┤╪┐Ї╕╞╜╨д╖╗■д╦╚п└╕д╖д┐ NSException дЄ OSX::OCException д╦╩╤┤╣д╖д╞╬у
│░дЄ╚п└╕д╡д╗дыдшджд╦д╖д┐бг

=== GC ┤╪╧ве╨е░д╬╜д└╡

NIB е╒ебедеы╞тд╟едеєе╣е┐еєе╣▓╜д╡дьд┐ Ruby еке╓е╕езепе╚д╩д╔дм GC д╦дшд├
д╞┴▌╜№д╡дьд╞д╖д▐дже╨е░дЄ╜д└╡бг

=== е╣еье├е╔└┌┬╪дид╦┤╪д╣ды╩╤╣╣

osx_objc.bundle д╬еэб╝е╔╗■д╦е╣еье├е╔└┌┬╪дидЄ│л╗╧д╣дыдшджд╦д╖д┐
(ruby_thread_switcher_start)бге╣еье├е╔└┌┬╪дид╧ NSTimer дЄ╗╚д├д╞╝┬┴їд╖
д╞дддыд┐дс NSRunLoop дм▓єд├д╞ддд╩ддд╚днд╦д╧╡б╟╜д╖д╩ддбг

=== rb_main.rb д╬╩╤╣╣

е╨еєе╔еыеъе╜б╝е╣╞тд╬ .rb е╒ебедеыдЄд╣д┘д╞еэб╝е╔д╣дыдшджд╦д╖д┐бг
RubyCocoa еве╫еъе▒б╝е╖ечеє│л╚п╗■д╦ rb_main.rb дЄ╩╤╣╣д╣ды╔м═╫д╧д╩дпд╩д├
д┐бг


== 0.2.7длдщд╬дкдтд╩╩╤╣╣┼└

=== [INPROVE] Jaguar (Mac OS X 10.2)д╦┬╨▒■бг

* Jaguar╔╒┬░д╬Ruby 1.6.7д╬д▀д╟╝┬╣╘▓─╟╜
* Jabuar╔╒┬░д╬Developer Toolsд╬д▀д╟е╜б╝е╣длдщд╬╣╜├█дм▓─╟╜
* LibRuby.frameworkдЄ╟╤┤■
* RubyCocoa.frameworkдЄ╟╤┤■
* Ruby╣╜├█╗■д╦ "--enabled-shared" д╬╗╪─ъд╧╔╘═╫

(├э) └╡╛яд╦╞░║юд╣дые╔енехесеєе╚е┘б╝е╣еве╫еъе▒б╝е╖ечеєдЄ║юдыд┐дсд╦д╧ 
libruby.a дм╔м═╫д╟д╣бге╜б╝е╣╟█╔╒д╦д╧┤▐д▐дьд╞ддд▐д╗дєбгrubyд╬е╜б╝е╣длдщ
╝л╩мд╟║юдыдл ((<libruby.a.gz|URL:../rubyosx/files/libruby.a.gz>)) дЄе└
ежеєеэб╝е╔д╖д╞дпд└д╡ддбг

=== [IMPROVE] NS─ъ┐Ї,NS┤╪┐Їwrapper└╕└ое╣епеъе╫е╚дЄ▓■╬╔(cpp3╗╚═╤)бг

NS─ъ┐Ї,NS┤╪┐Їд╬╠д╝┬┴їдм╕║д├д┐бг

=== [IMPROVE] Cе▌едеєе┐д╬░·┐Їдф╠сдъ├═дЄ░╖дж╝ъ├╩дЄ╝┬┴ї

* OSX::ObjcPtr д╚ддджепеще╣дЄ╞│╞■
* ┤╪┐Їбжесе╜е├е╔д╬╠сдъ├═дмCе▌едеєе┐д╬╛ь╣ч OSX::ObjcPtr д╬едеєе╣е┐еєе╣дЄ╩╓д╣
* ░·┐ЇдмCе▌едеєе┐д╬╛ь╣ч OSX::ObjcPtr д▐д┐д╧ String д╟┼╧д┐д╣

д│д╬╡б╟╜д╧Cд╬е▌едеєе┐дфеве╔еье╣д╦─╛└▄евепе╗е╣д╣дыд│д╚д╬░╒╠гдЄ═¤▓Єд╖д╩
ддд╟╗╚джд╚┤э╕▒д╟д╣д╬д╟├э░╒д╖д╞дпд└д╡ддбг╠сдъ├═д╬Cе▌едеєе┐д╬╝ид╣└шдм 
NSAutoreleasePool#release д╩д╔д╦дшд├д╞┤√д╦▓їд╡дьд╞дддыд┐дс╗Ў╝┬╛х Ruby 
еье┘еыд╟д╧╗╚дид╩дде▒б╝е╣дтдвдъд▐д╣бг
(NSString#availableStringEncodingsд╩д╔)

=== [IMPROVE] NSDictionary ░·┐Ї

┤╪┐Їбжесе╜е├е╔д╬░·┐Їдм NSDictionary д╬╛ь╣ч Hash дм┼╧д╗дыдшджд╦д╩д├д┐бг

=== д╜д╬┬╛ Jaguar ┤╪╧в

░╩┴░д╧ irb д╟╗╚джд╚днд╦ Bus Error дм┬┐╚пд╖д╞ддд▐д╖д┐дмдлд╩дъ░┬─ъд╖д╞╗╚
дидыдшджд╦д╩дъд▐д╖д┐бг

Jaguar д╟д╧е│е▐еєе╔ещедеєдлдщеве╫еъе▒б╝е╖ечеєе╨еєе╔еыд╩д╖д╟ GUI еве╫еъ
дЄ╝┬╣╘д╟дндыдшджд╦д╩д├д╞дддыдшджд╟д╣бг

  % cd {RubyCocoa sample}/Hokoiri-Musume
  % ruby rb_main.rb

д╟╚в╞■дъ╠╝д╬ежегеєе╔еждм│лддд╞е╤е║еыд╟═╖д┘д▐д╣бг


== 0.2.6длдщд╬дкдтд╩╩╤╣╣┼└

[CHANGES] NS┤╪┐Їбж─ъ┐Їд╬ Mac OS X 10.2 ┬╨▒■бгNSAppleScriptд╩д╔бг

[CHANGES] NSSoundдЄ╗╚д├д╞дддые╡еєе╫еыд╬ Mac OS X 10.2 ┬╨▒■бг

[BUGFIX] TOPеье┘еы░╩│░д╟─ъ╡┴д╖д┐Cocoaд╬╟╔└╕епеще╣д╬едеєе╣е┐еєе╣дЄ║юды
д│д╚дмд╟днд╩дд╠ф┬ъдЄ▓Є╖шд╖д┐бг

  module MyModule
    class AppController < OSX::NSObject
    end
  end

[BUGFIX] NSStringд╚д╬╩╕╗·╬є╩╤┤╣д╬д╚днбв├ц┤╓д╦\0дЄ┤▐др╩╕╗·╬єдЄ└╡д╖дп╜ш
═¤д╣дыдшджд╦д╖д┐бг

[CHANGES] Objective-Cд╚Rubyд╬┤╓д╟д╬еке╓е╕езепе╚╩╤┤╣дмд╟днд╩длд├д┐д╚дн
╛ь╣чбв╬у│░OSX::OCDataConvExceptionдЄ╚п└╕д╡д╗дыдшджд╦д╖д┐бг


== 0.2.5длдщд╬дкдтд╩╩╤╣╣┼└

[BUGFIX] BOOLдЄ╩╓д╣екб╝е╨ещеде╔есе╜е├е╔дм└╡╛яд╦╞░ддд╞д╩длд├д┐(д╧д║)д╬
е╨е░дЄ╜д└╡бг

[IMPROVE] Cocoaд╬е░еэб╝е╨еы┤╪┐Ї╩╤┐Їд╬еще├е╨б╝╝л╞░└╕└ое╣епеъе╫е╚дЄ▓■╬╔бг
д╜д╬╖ы▓╠"not implemented"д╩Cocoaд╬е░еэб╝е╨еы┤╪┐Ї╩╤┐Їдм╕║╛пбг┐╖д╖дпе╡е▌б╝
е╚д╖д┐дтд╬д╦д╧NSGenericException╖╧╬є,NSUnionRange╖╧╬єд╩д╔дм┤▐д▐дьдыбг

[IMPROVE] е╔енехесеєе╚е┘б╝е╣еве╫еъе▒б╝е╖ечеє═╤д╬ProjectBuilderе╞еєе╫еьб╝
е╚дЄ─╔▓├бг

[CHANGE] ProjectBuilderе╞еєе╫еьб╝е╚д╬╠╛┴░дЄ╩╤╣╣бг

[CHANGE] ╜у┐шд╩Rubyд╬еке╓е╕езепе╚дЄ░·┐Їд╚д╖д╞╗╚дж╛ь╣чд╬д┐дсд╦бв
Objective-Cесе╜е├е╔д╬░·┐Їд╬╖┐дмObjective-Cеке╓е╕езепе╚д╬╛ь╣чд╬┐╢ды╔ёдд
дЄ╩╤╣╣бг

[IMPROVE] е╖б╝е╚е╤е═еы┬╨▒■дЄ▓■╬╔бгCallbuckд╡дьдыесе╜е├е╔д╦д╧
"_returnCode_contextInfo"д╟╜кды╠╛┴░дЄд─д▒ды╔м═╫дмдвдыбг

[IMPROVE] еэб╝елещеде║╩╕╗·╬є═╤д╬ете╕ехб╝еы┤╪┐ЇдЄ─ъ╡┴

  OSX::NSLocalizedStringFromTableInBundle
  OSX::NSLocalizedStringFromTable
  OSX::NSLocalizedString

[IMPROVE] е╗еьепе┐╠╛дм'_'д╟╗╧д▐дыесе╜е├е╔(╬удид╨"_transparency")д╬╕╞д╙
╜╨д╖д╦┬╨▒■

[IMPROVE] е╨б╝е╕ечеє╛Ё╩єд╬е╡е▌б╝е╚

  OSX::RUBYCOCOA_VERSION
  OSX::RUBYCOCOA_RELEASE_DATE


== 0.2.4длдщд╬дкдтд╩╩╤╣╣┼└

[BUGFIX] NSString.availableStringEncodingsдм═юд┴дые╨е░дЄ╜д└╡

[BUGFIX] е╣б╝е╤б╝епеще╣д╦┬╕║▀д╖д╩ддесе╜е├е╔дЄns_overridesд╬░·┐Їд╦═┐ди
д┐д╚днд╦═юд┴дые╨е░дЄ╜д└╡

[IMPROVE] NSOpenPanel, NSSavePanel, NSPrintPanel д╬е╖б╝е╚е╤е═еыд╦┬╨▒■

[CHANGE] е╞еєе╫еьб╝е╚д╦PureEmptyApp.appдЄ─╔▓├бгд│дьд╧EmptyApp.appдлдщ
NIBе╒ебедеыд╦┤╪д╣ды╞т═╞дЄ╝шдъ╜№ддд┐дтд╬бг


== 0.2.3длдщд╬дкдтд╩╩╤╣╣┼└

[BUGFIX] екб╝е╨б╝ещеде╔д╖д┐есе╜е├е╔д╬░·┐Їд╬░╖ддд╦┤╪д╣дые╨е░дЄ╜д└╡бг
(Chrisд╡дєдвдъдмд╚дж)

[BUGFIX] екб╝е╨б╝ещеде╔д╖д┐есе╜е├е╔длдщ((|self|))дЄ╩╓д╣е│б╝е╔д╩д╔дмдж
д▐дп╞░длд╩дде╨е░дЄ╜д└╡д╖д┐бг╝бд╬дшджд╩е│б╝е╔дм┤№┬╘д╔дкдъ╞░дпдшджд╦д╩д├
д┐бг

  class MyView < OSX::NSView

    ns_overrides :initWithFrame_
    
    def initWithFrame (frame)
      suuper_initWithFrame (frame)
      self
    end


== 0.2.2длдщд╬дкдтд╩╩╤╣╣┼└

[BUGFIX] еке╓е╕езепе╚└╕└о╗■д╦есетеъдЄ4е╨еде╚╟╦▓їд╖д╞ддд┐е╨е░дЄ╜д└╡бг
(Chrisд╡дєдвдъдмд╚дж)

[CHANGE] Rubyе╣еье├е╔└┌дъ┬╪ди(OSX.ruby_thread_switcher_start)дЄ▓■╬╔бг


== 0.2.1длдщд╬дкдтд╩╩╤╣╣┼└

0.2.1 д╬едеєе╣е╚б╝еые╣епеъе╫е╚д╬╜┼┬чд╩е╨е░дЄ╜д└╡

[CHANGE] RubyCocoaе╒еьб╝ереяб╝епдЄедеєе╣е╚б╝еыд╣дые╟егеьепе╚еъд╬╗╪─ъ╩¤
╦бдЄ░╩▓╝д╬дшджд╦╩╤╣╣

  % ruby install.rb config --frameworks=/Network/Library/Frameworks

== 0.2.0длдщд╬дкдтд╩╩╤╣╣┼└

[IMPROVE] RubyCocoaеве╫еъе▒б╝е╖ечеєд╟Rubyе╣еье├е╔дЄ└┌┬╪дидыд┐дсд╬╗┼┴╚
д▀дЄе╞е╣е╚┼кд╦╝┬┴їбг

[IMPROVE] екб╝е╨б╝ещеде╔д╖д┐есе╜е├е╔─ъ╡┴д╬├цд╟е╣б╝е╤б╝епеще╣д╬╞▒есе╜е├
е╔дЄ╕╞д╓╡б╟╜дЄе╞е╣е╚┼кд╦╝┬┴їбг

  def drawRect (frame)
    super_drawRect (frame)
  end

[BUGFIX] екб╝е╨б╝ещеде╔есе╜е├е╔д╬╠сдъ├═д╦┤╪д╣ды╛ое╨е░дЄ╜д└╡бг

[IMPROVE] RubyCocoaе╒еьб╝ереяб╝епд╬едеєе╣е╚б╝еы└шдЄеке╫е╖ечеєд╟╗╪─ъд╟
дндыдшджд╦д╖д┐бг

  % ruby install.rb config -- --frameworks=/Network/Library/Frameworks


== 0.1.3длдщд╬дкдтд╩╩╤╣╣┼└

=== ╗┼══/╝┬┴ї

[CHANGE] OSX::OCObject д╧╬в╩¤д╦д╩д├д┐бг

[CHANGE] Cocoa епеще╣дЄ Ruby д╬епеще╣д╚д╖д╞─ъ╡┴бг

  OSX::NSObject.is_a? Class # => true
  OSX::NSObject.name        # => "OSX::NSObject"

[CHANGE] OSX::OCObject#ib_loadable дЄ╟╤╗▀бгCocoa епеще╣д╬╟╔└╕епеще╣д╬
─ъ╡┴дЄбвRuby д╬╟╔└╕епеще╣д╬─ъ╡┴д╚╞▒══д╬╩¤╦бд╟╜ёд▒дыдшджд╦╩╤╣╣бг

  class Hoge < OSX::NSView
    ns_outlets   :hoge
    ns_overrides :drawRect_
    ...
  end

[CHANGE] Cocoa╟╔└╕епеще╣#ns_overrides д╬░·┐Їд╦е╖еєе▄еыдЄ╗╚═╤▓─бгд┐д└д╖
░·┐Їд╦┬╨▒■д╣ды"_"д╬╛╩╬мд╧д╟днд╩ддбг(╛х╡н╬уд╬drawRect)

[CHANGE] ╛х╡н╩╤╣╣д╬┤Ё╚╫д╚д╖д╞ OSX::ObjcID епеще╣бвOSX::OCObjWrapperет
е╕ехб╝еыдЄ─╔▓├ (─╠╛яд│дьдщд╧─╛└▄╗╚дждтд╬д╟д╧д╩дд)

[CHANGE] lib/osx/objcе╟егеьепе╚еъдЄ║юдъбвRuby┬жещеде╓ещеъд╬╦▄┬╬д╧д╜д╬
├цд╦├╓дпдшджд╦д╖д┐бг

[CHANGE] C┬жещеде╓ещеъ╠╛дЄ"osxobjc.bundle"длдщ"osx_objc.bundle"д╦╩╤╣╣бг
RubyAEOSAд╚┼¤░ьбг

=== е╔енехесеєе╚

еъе╒ебеьеєе╣е▐е╦ехевеыдЄ▓├дид▐д╖д┐бг╗╚дд╩¤д╦епеще╣─ъ╡┴д╦┤╪д╣ды╡н╜╥дЄ▓├
дид▐д╖д┐бг


== 0.1.2длдщд╬дкдтд╩╩╤╣╣┼└

=== ╝┬┴ї

[IMPROVE] е│еєе╤едеы┬о┼┘дм┬ч╔¤еве├е╫ (Chrisд╡дєд╔дждт)

[IMPROVE] Cocoaеке╓е╕езепе╚д╬есе╜е├е╔╝┬╣╘╗■д╦╚п└╕д╖д┐╬у│░дЄRubyд╬╬у│░
д╚д╖д╞╚п└╕д╡д╗ды╡б╟╜дЄ╝┬┴ї (Chrisд╡дєд╔дждт)

=== д╜д╬┬╛

FAQд╦┐Ї╣р╠▄─╔▓├


== 0.1.1длдщд╬дкдтд╩╩╤╣╣┼└

=== ╝┬┴ї

[BUGFIX] ib_loadalbeд╬├цд╟Objective-Cд╬епеще╣дЄ╞░┼к└╕└од╣дыд╡ддд╬есет
еъ│фдъ┼Ўд╞д╦┤╪д╣дые╨е░дЄ╜д└╡бг

[CHANGE] 0.1.0д╬б╓(({ib_lodable}))д╩епеще╣─ъ╡┴д╬╜щ┤№▓╜есе╜е├е╔
(({initialize})) д╦░·┐ЇдЄ┼╧д╣╗┼┴╚д▀б╫дЄ╟╤╗▀бгRuby┬жд╬initializeд╦д╧
ObjC┬жд╬initXXXд╬░·┐Їд╧┼╧дъд▐д╗дєбг

[IMPROVE] NSRange(Cocoa)д╚Range(Ruby)д╬╩╤┤╣дЄе╡е▌б╝е╚(Chrisд╡дєд╔дждт)

=== д╜д╬┬╛

е╡еєе╫еыд╦multinibдЄ─╔▓├ (Lucд╡дєд╔дждт)


== 0.1.0длдщд╬дкдтд╩╩╤╣╣┼└

=== ╝┬┴ї

[IMPROVE] ╔м═╫д╩д╚днд╦Rubyд╬NumericдлдщCocoaд╬NSDecimalNumberд╪д╬╩╤┤╣
дЄ╣╘джбг(б╓Learning Cocoa CH.9б╫┬╨▒■)

[IMPROVE] (0.1.2д╟╟╤╗▀) (({ib_lodable}))д╩епеще╣─ъ╡┴д╬╜щ┤№▓╜есе╜е├е╔
(({initialize})) д╦░·┐ЇдЄ┼╧д╣╗┼┴╚д▀дЄ╜р╚ўбг╝┬║▌д╦╗╚д├д╞дддыд╬д╧ 
(({ib_loadable :NSView})) д╬д╚днд╬д▀бг

=== д╜д╬┬╛

е╡еєе╫еыdotviewдЄ"Lerning Cocoa"д╬8╛╧дЄ╞╔д▀д╩дмдщ╜ёдн─╛д╖д┐бг

"Lerning Cocoa"д╦┴ъ┼Ўд╣дые╡еєе╫еыExpenses.appдЄ─╔▓├бг

е╞еєе╫еьб╝е╚╬рдЄе╡еєе╫еые╟егеьепе╚еъдлдще╞еєе╫еьб╝е╚е╟егеьепе╚еъд╦░▄╞░бг

Empty.app дЄе╞еєе╫еьб╝е╚д╦─╔▓├бгд│дьдЄе│е╘б╝д╖д╞╗╚дид╨бвmake дф
pbxbuildдЄ╗╚дяд║бвRubyе╣епеъе╫е╞егеєе░д╚nibе╒ебедеыд╩д╔д╬╩╤╣╣д╬д▀д╟
Cocoaеве╫еъе▒б╝е╖ечеєдЄ║ю└о▓─╟╜бг

$Date: 2005-10-28 23:53:26 +0900 (щЗС, 28 10 2005) $
$Revision: 864 $
