# -*-rd-*-
= RubyCocoaеъе╒ебеьеєе╣

== OSX::ObjcIDепеще╣

Objective-Cеке╓е╕езепе╚д╬еще├е╤б╝бгдвды░ьд─д╬Objective-Cеке╓е╕езепе╚д╬
екб╝е╩б╝д╚д╩дъд╜дьдЄ╩ёд▀д▐д╣бг─╠╛ябвд│д╬епеще╣д╬┬╕║▀дЄ░╒╝▒д╣ды╔м═╫д╧дв
дъд▐д╗дєбг

=== OSX::ObjcIDепеще╣д╬едеєе╣е┐еєе╣есе╜е├е╔

--- OSX::ObjcID#inspect

      еке╓е╕езепе╚д╬╛Ё╩єдЄ╔╜д╣╩╕╗·╬єдЄ╩╓д╖д▐д╣бг

--- OSX::ObjcID#__ocid__

      ╩ёдєд╟дддыObjective-Cеке╓е╕езепе╚д╬idд╬├═дЄ└░┐Їд╟╩╓д╖д▐д╣бг

--- OSX::ObjcID#__inspect__

      OSX::ObjcID#inspectд╚╞▒д╕д╟д╣бг


== OSX::OCObjWrapperете╕ехб╝еы

Objective-Cеке╓е╕езепе╚д╦┬╨д╖д╞есе├е╗б╝е╕┴ў┐о(есе╜е├е╔╕╞д╙╜╨д╖)дЄ╣╘дж
╡б╟╜дЄ╝┬┴їд╖д┐е▀е├епе╣едеєете╕ехб╝еыд╟д╣бгRubyCocoaд╟д╧бвCocoaеке╓е╕ез
епе╚д╦д│д╬ете╕ехб╝еыдЄ┴ї├хд╖д╞дддыд┐дсд╦бвCocoaеке╓е╕езепе╚д╦┬╨д╣дыесе├
е╗б╝е╕┴ў┐одм▓─╟╜д╚д╩д├д╞ддд▐д╣бг

д│д╬ете╕ехб╝еыдЄ┴ї├хд╣дыеке╓е╕езепе╚д╧бв┴р║юд╬┬╨╛▌д╚д╩дыObjective-Cек
е╓е╕езепе╚дЄ╞├─ъд╣дыд┐дсд╦бв╝бд╬ддд║дьдлд╬╛Є╖ядЄ╦■д┐д╖д╞ддды╔м═╫дмдвдъ
д▐д╣бг

  * ((<OSX::ObjcIDепеще╣>))д╬едеєе╣е┐еєе╣д╟двды
  * ((<OSX::ObjcID#__ocid__>))д╚╞▒д╕╗┼══д╬есе╜е├е╔дЄ╝┬┴їд╖д╞ддды

─╠╛ябвд│д╬ете╕ехб╝еыд╬┬╕║▀╝л┬╬дЄ░╒╝▒д╣ды╔м═╫д╧двдъд▐д╗дєдмбвесе├е╗б╝е╕
┴ў┐од╬еселе╦е║ерд╩д╔RubyCocoaд╬╞░дндЄ═¤▓Єд╣ды╛хд╟д╧║╟дт╜┼═╫д╩╔Ї╩мд╟дт
двдъд▐д╣бг


=== Objective-Cеке╓е╕езепе╚д╪есе├е╗б╝е╕дЄ┴ў┐од╣ды╗┼┴╚д▀

OSX::OCObjWrapperете╕ехб╝еыд╧еке╓е╕езепе╚дм╜ш═¤д╟днд╩длд├д┐есе╜е├е╔╕╞
д╙╜╨д╖дм((|method_missing|))д╦▓єд├д╞═шды╗┼┴╚д▀дЄ═°═╤д╖д╞бв┴р║ю┬╨╛▌д╬
Objective-Cеке╓е╕езепе╚д╦┬╨д╖д╞есе├е╗б╝е╕дЄ┴ў┐од╖д╞ддд▐д╣бг

=== Rubyесе╜е├е╔╠╛длдщObjective-Cесе├е╗б╝е╕е╗еьепе┐д╪д╬╩╤┤╣

Rubyд╬└д│жд╟д╬есе├е╗б╝е╕┴ў┐о(есе╜е├е╔╕╞д╙╜╨д╖)дЄObjective-Cд╬└д│жд╟д╬
есе├е╗б╝е╕┴ў┐од╦е▐е├е╫д╣дыд┐дсд╦д╧бвRubyд╬есе╜е├е╔╠╛дЄObjective-Cд╬есе├
е╗б╝е╕е╗еьепе┐д╦╩╤┤╣д╣ды╔м═╫дмдвдъд▐д╣бг

б╓есе├е╗б╝е╕е╗еьепе┐д╬':'дЄ'_'д╦├╓дн┤╣дид┐дтд╬дмRubyд╟д╬есе╜е├е╔╠╛б╫

д│дьдм╩╤┤╣д╬┤Ё╦▄еыб╝еыд╟д╣бг╬удид╨бвесе├е╗б╝е╕е╗еьепе┐ 
'doSomething:with:with:' д╬есе├е╗б╝е╕дЄ┴ў┐од╣ды╛ь╣чбвRubyд╟д╬есе╜е├е╔
╠╛д╧ 'doSomething_with_with_' д╚д╩дъд▐д╣бг

╝┬║▌д╦д╧┤Ё╦▄еыб╝еыд╬┬╛д╦бв╕лд┐╠▄дЄ╬╔дпд╣дыд┐дс░╩▓╝д╦╝ид╣дшджд╩╔╜╕╜д╬е╨
еъеиб╝е╖ечеєдм┬╕║▀д╖д▐д╣бг

  (1) ╦Ў╚°д╬'_'дЄ╛╩╬мд╣ды
  (2) ░·┐Їд╬├цд╦енб╝еяб╝е╔дЄ║од╝ды

д│дьд└д▒д╟д╧═¤▓Єд╟днд╩ддд╚╗╫ддд▐д╣дмбв└т╠└д╣дыд╬дт╞ёд╖ддд╬д╟╢ё┬╬╬уд╟╝и
д╖д▐д╣бг

  [rcv doSomething: a with: b with: c]      // Objective-Cд╬╛ь╣ч
  rcv.doSomething_with_with_ (a, b, c)      # ┤Ё╦▄еыб╝еы
  rcv.doSomething_with_with (a, b, c)       # е╨еъеиб╝е╖ечеє(1)
  rcv.doSomething (a, :with, b, :with, c)   # е╨еъеиб╝е╖ечеє(2)


=== есе╜е├е╔╠╛└▄╞м╝н "oc_"

╠╛┴░дм"oc_"д╟╗╧д▐дыесе╜е├е╔д╧─╛└▄бв┴р║ю┬╨╛▌д╬Objective-Cеке╓е╕езепе╚д╪
есе├е╗б╝е╕┴ў┐од╡дьд▐д╣бг╝чд╚д╖д╞бвRuby┬жд╚Objective-C┬жд╬╬╛╩¤д╦╞▒╠╛д╬
есе╜е├е╔дм┬╕║▀д╣ды╛ь╣чд╦╗╚ддд▐д╣бг


=== есе╜е├е╔╠╛└▄╚°╝н "?"

╠╛┴░д╬║╟╕хд╦ "?" дЄд─д▒д╞┴ў┐од╖д┐есе├е╗б╝е╕д╧бв╩╓д├д╞днд┐├═дм0д╟двдыдл
─┤д┘д╞┐┐╡╢├═дЄ╩╓д╖д▐д╣бгд│дьд╧┐┐╡╢├═дЄ╩╓д╣есе╜е├е╔╕╞д╙╜╨д╖д╬д╚днд╦╗╚дд
д▐д╣бг

Objective-Cд╬есе╜е├е╔д╧┐┐╡╢├═дЄ├▒д╩ды┐Ї├═(0д╩дщ╡╢бвд╜д╬┬╛д╧┐┐д╬░╒)д╟╩╓
д╖д╞дпдыд╬д╟бвRubyд╟д╧д╜д╬├═д╬░╒╠гдм┐Ї├═д╩д╬длдвдыддд╧┐┐╡╢├═д╩д╬длдЄ╚╜
├╟д╟днд▐д╗дєбгд╡дщд╦Rubyд╟д╧0дт1дт┐┐д╬дшджд╦┐╢ды╔ёджд╬д╟бвд╜д╬д▐д▐╗╚дж
д╚╧└═¤дм╩°дьд╞д╖д▐ддд▐д╣бгд╖д┐дмд├д╞┐┐╡╢├═дЄ╩╓д╣есе╜е├е╔дЄ╕╞д╙╜╨д╣д╚дн
д╦д╧ "?"└▄╚°╝ндЄ╗╚дж╔м═╫дмдвдъд▐д╣бг


=== OSX::OCObjWrapperете╕ехб╝еыд╬едеєе╣е┐еєе╣есе╜е├е╔

--- OSX::OCObjWrapper#to_s

      ┴р║ю┬╨╛▌д╬Objective-Cеке╓е╕езепе╚д╬Ruby╩╕╗·╬єд╦дшды╔╜╕╜дЄ╩╓д╖д▐
      д╣бг

--- OSX::OCObjWrapper#to_a

      ┴р║ю┬╨╛▌д╬Objective-Cеке╓е╕езепе╚д╬Ruby╟█╬єд╦дшды╔╜╕╜дЄ╩╓д╖д▐д╣бг

--- OSX::OCObjWrapper#to_i

      ┴р║ю┬╨╛▌д╬Objective-Cеке╓е╕езепе╚д╬└░┐Ї├═д╦дшды╔╜╕╜дЄ╩╓д╖д▐д╣бг

--- OSX::OCObjWrapper#to_f

      ┴р║ю┬╨╛▌д╬Objective-Cеке╓е╕езепе╚д╬╝┬┐Ї├═д╦дшды╔╜╕╜дЄ╩╓д╖д▐д╣бг

--- OSX::OCObjWrapper#objc_methods

      ┴р║ю┬╨╛▌д╬Objective-Cеке╓е╕езепе╚д╬есе╜е├е╔╠╛д╬░ь═ўдЄ╩╓д╖д▐д╣бг

--- OSX::OCObjWrapper#objc_method_type

      ┴р║ю┬╨╛▌д╬Objective-Cеке╓е╕езепе╚д╬есе╜е├е╔д╬╖┐дЄ╩╓д╖д▐д╣бг

--- OSX::OCObjWrapper#ocm_responds? (name)

      ┴р║ю┬╨╛▌д╬Objective-Cеке╓е╕езепе╚дмбв░·┐Ї((|name|))д╟╗╪─ъд╡дьд┐
      есе╜е├е╔д╦▒■┼·▓─╟╜длд╔дждлдЄ╝ид╣┐┐╡╢├═дЄ╩╓д╖д▐д╣бг((|name|))д╧есе├
      е╗б╝е╕е╗еьепе┐д╜д╬дтд╬дл┤Ё╦▄еыб╝еыд╦╜╛д├д┐дтд╬д╟д╩д▒дьд╨д╩дъд▐д╗
      дєбг─╠╛ябвд│д╬есе╜е├е╔дЄ╗╚дж╔м═╫д╧двдъд▐д╗дєбг

--- OSX::OCObjWrapper#ocm_send (name ...)

      ┴р║ю┬╨╛▌д╬Objective-Cеке╓е╕езепе╚д╦┬╨д╖д╞бв░·┐Ї((|name|))д╟╗╪─ъ
      д╡дьд┐есе╜е├е╔дЄ╗─дъд╬░·┐Їд╚д╚дтд╦┴ў┐од╖д▐д╣бг((|name|))д╧есе├е╗б╝
      е╕е╗еьепе┐д╜д╬дтд╬дл┤Ё╦▄еыб╝еыд╦╜╛д├д┐дтд╬д╟д╩д▒дьд╨д╩дъд▐д╗дєбг
      ─╠╛ябвд│д╬есе╜е├е╔дЄ╗╚дж╔м═╫д╧двдъд▐д╗дєбг


== OSX::OCObjectепеще╣

╚╞═╤д╬Objective-Cеке╓е╕езепе╚еще├е╤б╝бгOSXете╕ехб╝еы░╩▓╝д╦─ъ╡┴д╡дьд╞дд
дыд╔д╬Cocoaепеще╣д╦дт┬░д╡д╩ддObjective-Cеке╓е╕езепе╚д╧бвд│д╬епеще╣д╬ед
еєе╣е┐еєе╣д╚д╖д╞└╕└од╡дьд▐д╣бг─╠╛ябвд│д╬епеще╣д╬едеєе╣е┐еєе╣дЄ╠└╝и┼кд╦
└╕└од╖д┐дъбв╟╔└╕епеще╣дЄ─ъ╡┴д╣ды╔м═╫д╧двдъд▐д╗дєбг

=== е╣б╝е╤б╝епеще╣
((<OSX::ObjcIDепеще╣>))

=== едеєепеыб╝е╔д╖д╞дддыете╕ехб╝еы
((<OSX::OCObjWrapperете╕ехб╝еы>))


== Cocoaепеще╣

((|NSObject, NSString, NSApplication|))д╩д╔┴┤д╞д╬Cocoaепеще╣д╧бв
((|OSX::NSObject, OSX::NSString, OSX::NSApplication|)) д╬дшджд╦OSXет
е╕ехб╝еыд╦┬░д╣дыRubyд╬епеще╣д╚д╖д╞─ъ╡┴д╡дьд╞ддд▐д╣бг

Cocoaепеще╣╝л┬╬д╦дтCocoaеке╓е╕езепе╚д╚д╖д╞((<OSX::OCObjWrapperете╕ехб╝
еы>))дм┴ї├хд╡дьд╞ддд▐д╣бг

=== едеєепеыб╝е╔д╖д╞дддыете╕ехб╝еы
((<OSX::OCObjWrapperете╕ехб╝еы>))

=== ┴ї├хд╖д╞дддыете╕ехб╝еы
((<OSX::OCObjWrapperете╕ехб╝еы>))

=== Cocoaепеще╣д╬епеще╣есе╜е├е╔

--- Cocoaепеще╣.__ocid__

      Cocoaепеще╣еке╓е╕езепе╚д╬idд╬├═дЄ└░┐Їд╟╩╓д╖д▐д╣бг


== Cocoa╟╔└╕епеще╣

Cocoaепеще╣д╬╟╔└╕епеще╣бг

=== Cocoa╟╔└╕епеще╣д╬епеще╣есе╜е├е╔

--- Cocoa╟╔└╕епеще╣.ns_overrides (...)

      е╣б╝е╤б╝епеще╣д╬есе╜е├е╔дЄекб╝е╨б╝ещеде╔дЄ└ы╕└д╖д▐д╣бг
      Objective-Cд╬└д│ждлдщ─╛└▄╕╞д╨дьдыесе╜е├е╔дЄекб╝е╨б╝ещеде╔д╣дыд╚
      днд╦д╧бвд│д╬└ы╕└дм╔м═╫д╦д╩дъд▐д╣бг┼╡╖┐┼кд╩╬уд╚д╖д╞д╧бвNSViewд╬╟╔
      └╕епеще╣д╟((|drawRect:|))дЄекб╝е╨б╝ещеде╔д╣ды╛ь╣чд╩д╔дмдвд▓дщдь
      д▐д╣бг░·┐Їд╦д╧┤Ё╦▄еыб╝еыд╦╜╛д├д┐есе╜е├е╔╠╛дЄ╬є╡єд╖д▐д╣бг

--- Cocoa╟╔└╕епеще╣.ib_overrides (...)

      ns_overrides д╬╩╠╠╛

--- Cocoa╟╔└╕епеще╣.ns_outlets (...)

      евеже╚еье├е╚дЄ└ы╕└д╖д▐д╣бг╝┬║▌д╦д╧((|attr_writer|))дЄ╕╞дєд╟ддды
      д└д▒д╟д╣бг

--- Cocoa╟╔└╕епеще╣.ib_outlets (...)

      ns_outlets д╬╩╠╠╛

=== едеєе╣е┐еєе╣есе╜е├е╔└▄╞м╝н "super_"

ns_overridesд╟екб╝е╨б╝ещеде╔дЄ└ы╕└д╖д┐есе╜е├е╔д╦┤╪д╖д╞бве╣б╝е╤б╝епеще╣
д╟д╬╝┬┴їдЄ╗╚ддд┐дд╛ь╣чд╦д╧ "super_" дЄ╔╒д▒д┐есе╜е├е╔╠╛д╟╕╞д╙╜╨д╣д│д╚дм
д╟днд▐д╣бг

  def drawRect (frame)
    super_drawRect (frame)   # invoke SuperClass#drawRect
  end


== OSX::OCExceptionепеще╣

Objective-Cд╬└д│жд╟бвObjective-Cеке╓е╕езепе╚д╪д╬есе╜е├е╔╕╞д╙╜╨д╖д╦дшд├
д╞╬у│░((|NSException|))дм╚п└╕д╖д┐╛ь╣чбвд│д╬епеще╣д╬╬у│░дм╚п└╕д╖д▐д╣бг


=== OSX::OCExceptionепеще╣д╬едеєе╣е┐еєе╣есе╜е├е╔

--- OSX::OCException#name

      ╬у│░╠╛(NSException#name)дЄ╩╓д╖д▐д╣бг

--- OSX::OCException#reason

      ╬у│░д╬═¤═│╩╕╗·╬є(NSException#reason)дЄ╩╓д╖д▐д╣бг

--- OSX::OCException#userInfo

      ецб╝е╢╛Ё╩є(NSException#userInfo)дЄ╩╓д╖д▐д╣бг

--- OSX::OCException#nsexception

      NSExceptionдЄ╩╓д╖д▐д╣бг



== OSX::NSPointепеще╣

Foundationе╒еьб╝ереяб╝епд╟─ъ╡┴д╡дьд╞дддые╟б╝е┐╖┐((|NSPoint|))дЄRuby└д
│жд╟░╖джд┐дсд╬епеще╣д╟д╣бг

=== OSX::NSPointепеще╣д╬епеще╣есе╜е├е╔

--- OSX::NSPoint.new(x,y)

=== OSX::NSPointепеще╣д╬едеєе╣е┐еєе╣есе╜е├е╔

--- OSX::NSPoint#x
--- OSX::NSPoint#y
--- OSX::NSPoint#x= (val)
--- OSX::NSPoint#y= (val)

--- OSX::NSPoint#to_a

      ╟█╬є((|[x, y]|))дЄ╩╓д╖д▐д╣бг


== OSX::NSSizeепеще╣

Foundationе╒еьб╝ереяб╝епд╟─ъ╡┴д╡дьд╞дддые╟б╝е┐╖┐((|NSSize|))дЄRuby└д│ж
д╟░╖джд┐дсд╬епеще╣д╟д╣бг

=== OSX::NSSizeепеще╣д╬епеще╣есе╜е├е╔

--- OSX::NSSize.new(width, height)

=== OSX::NSSizeепеще╣д╬едеєе╣е┐еєе╣есе╜е├е╔

--- OSX::NSSize#width
--- OSX::NSSize#height
--- OSX::NSSize#width= (val)
--- OSX::NSSize#height= (val)

--- OSX::NSSize#to_a

      ╟█╬є((|[width, height]|))дЄ╩╓д╖д▐д╣бг


== OSX::NSRectепеще╣

Foundationе╒еьб╝ереяб╝епд╟─ъ╡┴д╡дьд╞дддые╟б╝е┐╖┐((|NSRect|))дЄRuby└д│ж
д╟░╖джд┐дсд╬епеще╣д╟д╣бг

=== OSX::NSRectепеще╣д╬епеще╣есе╜е├е╔

--- OSX::NSRect.new(origin, size)
--- OSX::NSRect.new(x, y, width, height)

=== OSX::NSRectепеще╣д╬едеєе╣е┐еєе╣есе╜е├е╔

--- OSX::NSRect#origin
--- OSX::NSRect#size
--- OSX::NSRect#origin= (val)
--- OSX::NSRect#size= (val)

--- OSX::NSRect#to_a

      ╟█╬є((|[[x, y], [width, height]]|))дЄ╩╓д╖д▐д╣бг


== OSX::NSRangeепеще╣

Foundationе╒еьб╝ереяб╝епд╟─ъ╡┴д╡дьд╞дддые╟б╝е┐╖┐((|NSRange|))дЄRuby└д
│жд╟░╖джд┐дсд╬епеще╣д╟д╣бг

=== OSX::NSRangeепеще╣д╬епеще╣есе╜е├е╔

--- OSX::NSRange.new(range)
--- OSX::NSRange.new(location, length)

=== OSX::NSRangeепеще╣д╬едеєе╣е┐еєе╣есе╜е├е╔

--- OSX::NSRect#location
--- OSX::NSRect#length
--- OSX::NSRect#location= (val)
--- OSX::NSRect#length= (val)

--- OSX::NSRect#to_a

      ((|[ location, length ]|))дЄ╩╓д╖д▐д╣бг

--- OSX::NSRect#to_range

      Rubyд╬Rangeеке╓е╕езепе╚дЄ╩╓д╖д▐д╣бг


$Date: 2002-12-29 19:36:19 +0900 (цЧе, 29 12 2002) $
$Revision: 554 $
