# -*-rd-*-
= ÉÕÂ°¥µ¥ó¥×¥ë¤ò»î¤·¤Æ¤ß¤ë

¥µ¥ó¥×¥ë¥Ç¥£¥ì¥¯¥È¥ê(¥Õ¥©¥ë¥À)¤ÎÃæ¤Ë¤¢¤ë¥¹¥¯¥ê¥×¥È¤ä¥¢¥×¥ê¥±¡¼¥·¥ç¥ó¤ò
»î¤·¤Æ¤ß¤Þ¤·¤ç¤¦¡£


== RubyCocoa¥¢¥×¥ê¥±¡¼¥·¥ç¥ó

¤Þ¤º¤Ï¤¹¤Ç¤Ë´°À®¤·¤Æ¤¤¤ëRubyCocoa¥¢¥×¥ê¥±¡¼¥·¥ç¥ó¤òµ¯Æ°¤·¤Æ¤ß¤Þ¤·¤ç¤¦¡£
Finder¤Ç'/Developer/Examples/RubyCocoa'¥Õ¥©¥ë¥À¤ò³«¤¤¤ÆSimpleApp¤ò
¥À¥Ö¥ë¥¯¥ê¥Ã¥¯¤·¤Æ¤ß¤Æ¤¯¤À¤µ¤¤¡£¥³¥Þ¥ó¥É¥é¥¤¥ó¤«¤é°Ê²¼¤Î¤è¤¦¤ËÆþÎÏ
¤·¤Æ¤âµ¯Æ°¤Ç¤­¤Þ¤¹¡£

  $ cd /Developer/Examples/RubyCocoa
  $ open SimpleApp.app


== ¥³¥Þ¥ó¥É¥é¥¤¥ó(Terminal)¤«¤é

RubyCocoa¤ò»È¤Ã¤Æ¥³¥Þ¥ó¥É¥é¥¤¥ó¤Ê¤É¤«¤é¼Â¹Ô¤¹¤ëÉáÄÌ¤Î¥¹¥¯¥ê¥×¥È¤ò½ñ¤¯
¤³¤È¤¬¤Ç¤­¤Þ¤¹¡£¥µ¥ó¥×¥ë¥Ç¥£¥ì¥¯¥È¥ê¤Ë°ÜÆ°¤·¤Æ

  $ cd /Developer/Examples/RubyCocoa

´ÊÃ±¤Ê¥¹¥¯¥ê¥×¥È¤ò¼Â¹Ô¤·¤Æ¤ß¤Þ¤·¤ç¤¦¡£

  $ ruby fontnames.rb  # ¥Õ¥©¥ó¥ÈÌ¾¤¬¤º¤é¤º¤é¤È½ÐÎÏ¤µ¤ì¤Þ¤¹
  $ ruby sndplay.rb    # ¥·¥¹¥Æ¥à¤Î·Ù¹ð²»¤¬½çÈÖ¤ËÌÄ¤ê¤Þ¤¹
  $ ruby sndplay2.rb   # ¥·¥¹¥Æ¥à¤Î·Ù¹ð²»¤¬½çÈÖ¤Ë´Ö³Ö¤òµÍ¤á¤ÆÌÄ¤ê¤Þ¤¹

Mac OS X 10.2¤ò»È¤Ã¤Æ¤¤¤ë¿Í¤Ï¤µ¤é¤Ë

  $ echo Hello World | ruby speak.rb
  $ head -5 speak_me.txt | ruby speak.rb

¤Ê¤É¤È¤ä¤Ã¤Æ¤ß¤ë¤È¤ª¤â¤·¤í¤¤¤Ç¤·¤ç¤¦¡£speak.rb¤ò°ú¿ôÌµ¤·¤Ç¼Â¹Ô¤¹¤ë¤È
'^D'(control¥­¡¼¤ò²¡¤·¤Ê¤¬¤é'D')¤òÆþÎÏ¤¹¤ë¤Þ¤Ç¡¢1¹ÔÆþÎÏ¤¹¤ë¤´¤È¤ËÆÉ¤ß¾å
¤²¤Þ¤¹¡£¤³¤ì¤Ï10.2¤«¤éCocoa¤Ë¼ÂÁõ¤µ¤ì¤¿AppleScript/AppleEvent¥¤¥ó¥¿¡¼
¥Õ¥§¡¼¥¹µ¡Ç½¤ò»È¤Ã¤Æ¤¤¤Þ¤¹¡£

¼¡¤Ë¡¢¥¦¥£¥ó¥É¥¦¤òÉ½¼¨¤¹¤ë¥¹¥¯¥ê¥×¥È¥µ¥ó¥×¥ë¤ò¼Â¹Ô¤·¤Æ¤ß¤Þ¤·¤ç¤¦¡£

  $ ruby HelloWorld.rb                       # ¥Ü¥¿¥ó£²¤Ä¤Î¥¦¥£¥ó¥É¥¦
  $ ruby TransparentHello.rb                 # Æ©ÌÀ¤Ê¥¦¥£¥ó¥É¥¦¤ËÊ¸»ú
  $ (cd Hakoiri-Musume && ruby rb_main.rb )  # ¥Ñ¥º¥ë¥²¡¼¥àÈ¢Æþ¤êÌ¼


== Makefile¥Ù¡¼¥¹¤Î¥½¡¼¥¹¤«¤éRubyCocoa¥¢¥×¥ê¥±¡¼¥·¥ç¥ó¤òºî¤ë

¼¡¤ËMakefile¥Ù¡¼¥¹¤Î¤â¤Î¤ò»î¤·¤Æ¤ß¤Þ¤·¤ç¤¦¡£

  $ cd /Developer/Examples/RubyCocoa/Hakoniwa-Musume
  $ make

¤Ç¹½ÃÛ¤Ç¤­¤Þ¤¹¡£¤Ç¤­¤¿¤é¼Â¹Ô¤·¤Æ¤ß¤Þ¤·¤ç¤¦¡£¤½¤Î¤Þ¤Þ¥³¥Þ¥ó¥É¥é¥¤¥ó¤«¤é

  $ open CocoHako.app

¤ÈÆþÎÏ¤¹¤ë¤«¡¢¥Õ¥¡¥¤¥ó¥À¤ÇCocoHako¤ò¥À¥Ö¥ë¥¯¥ê¥Ã¥¯¤·¤Æµ¯Æ°¤·¤Æ¤ß¤Æ¤¯¤À
¤µ¤¤¡£


== Project Builder¥Ù¡¼¥¹¤Î¥½¡¼¥¹¤«¤éRubyCocoa¥¢¥×¥ê¥±¡¼¥·¥ç¥ó¤òºî¤ë

¼¡¤ËProject Builder¥Ù¡¼¥¹¤Î¤â¤Î¤ò»î¤·¤Æ¤ß¤Þ¤·¤ç¤¦¡£¥³¥Þ¥ó¥É¥é¥¤¥ó¤«¤é

  $ cd /Developer/Examples/RubyCocoa/simpleapp
  $ pbxbuild      # ¥¢¥×¥ê¥±¡¼¥·¥ç¥óºîÀ®

¤È¤·¤Æ¹½ÃÛ¤·¤Þ¤¹¡£¤â¤Á¤í¤óProject Builder¤òµ¯Æ°¤·¤Æ¤½¤ÎÃæ¤Ç¹½ÃÛ¤·¤¿¤ê
¼Â¹Ô¤·¤¿¤ê¤¹¤ë¤³¤È¤â¤Ç¤­¤Þ¤¹¡£¼Â¹Ô¤·¤Æ¤ß¤Þ¤·¤ç¤¦¡£

  % open build/SimpleApp.app

¤ÈÂÇ¤Á¹þ¤à¤«¡¢¤Þ¤¿¤Ï¥Õ¥¡¥¤¥ó¥À¤Çbuild¥Õ¥©¥ë¥À¤ÎÃæ¤ÎSimpleApp¤ò¥À¥Ö¥ë¥¯
¥ê¥Ã¥¯¤·¤Æ¥¢¥×¥ê¥±¡¼¥·¥ç¥ó¤òµ¯Æ°¤·¤Æ¤ß¤Æ¤¯¤À¤µ¤¤¡£


== ¤µ¤é¤Ë...

Â¾¤Ë¤â¥µ¥ó¥×¥ë¤¬¤¤¤í¤¤¤í¤¢¤ë¤Î¤Ç¡¢Å¬Åö¤Ë»î¤·¤Æ¤ß¤¿¤ê¥¹¥¯¥ê¥×¥È¤òÆÉ¤ó¤Ç
¤ß¤Æ¤¯¤À¤µ¤¤¡£

== ÊäÂ­

* HelloWorld.rb ¤Ï ((<PyObjc|URL:http://pyobjc.sf.net/>))
  ÉÕÂ°¤ÎPython¤Ç½ñ¤«¤ì¤Æ¤¤¤¿¥µ¥ó¥×¥ë¥¹¥¯¥ê¥×¥È¤òRuby¤Ç½ñ¤¤¤¿¤â¤Î¤Ç¤¹¡£

* TransparentHello.rb¤Ï»¨»ï
  ((<DDJ(Dr.Dobbs Journal)2002Ç¯5·î¹æ
  |URL:http://www.ddj.com/articles/2002/0205/>))
  ¤ÎChris Thomas¤µ¤ó¤Îµ­»ö¤Ë·ÇºÜ¤µ¤ì¤¿¥¹¥¯¥ê¥×¥È¤Ç¤¹¡£

* RubyRaiseMan¤ÈRubyTypingTutor¤Ï
  ((<¡ØMac OS X Cocoa ¥×¥í¥°¥é¥ß¥ó¥°¡Ù
  |URL:http://www.amazon.co.jp/exec/obidos/ASIN/489471440X>))
  ¤Çºî¤ëObjective-C¤Î¥×¥í¥°¥é¥à¤òRuby¤Ç½ñ¤¤¤¿¤â¤Î¤Ç¤¹¡£

* MyViewer¤Ï
  ((<¡ØMac OS X ¥×¥í¥°¥é¥ß¥ó¥°ÆþÌç Objective-C¡Ù
  |URL:http://www.amazon.co.jp/exec/obidos/ASIN/4877780688>))
  ¤Çºî¤ëObjective-C¤Î¥×¥í¥°¥é¥à¤òRuby¤Ç½ñ¤¤¤¿¤â¤Î¤Ç¤¹¡£


$Date: 2004-12-03 21:26:03 +0900 (é‡‘, 03 12 2004) $
